# UnableToGroupElems Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToGroupElems Property
BuiltInFailures..::..GroupFailures Class See Also
---
Revit does not allow grouping of some of the selected elements. These elements will not be included in the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToGroupElems { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToGroupElems As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToGroupElems {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace